#!/usr/bin/env python
# -*- coding: utf-8 -*-

from __future__ import unicode_literals, print_function, division

KOR_CHAR_PATTERN = [
    'ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ',
    'ㅏ', 'ㅓ', 'ㅗ', 'ㅜ', 'ㅡ', 'ㅣ', 'ㅐ', 'ㅔ', 'ㅑ', 'ㅕ', 'ㅛ', 'ㅠ', 'ㅒ', 'ㅖ',
    'ㅘ', 'ㅙ', 'ㅝ', 'ㅞ', 'ㅚ', 'ㅟ', 'ㅢ'
]

SYMBOL_PATTERN = [
    ' ', '!', '.', ',' '/', '?', "'", '"', ':', ';', '{', '}', '[', ']', '(', ')', '@', '#', '$',
    '%', '^', '&', '*', '=', '+', '_', '-', '`', '~', '<', '>'
]

NUMBER_PATTERN = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']

ENG_CHAR_PATTERN = [
    'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
    'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
    'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
]
